Revit 2026 API

# TessellatedFace(IListXYZ, ElementId) Constructor

---

Initializes a new instance of the TessellatedFace class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TessellatedFace(
	IList<XYZ> outerLoopVertices,
	ElementId materialId
)
```
```vb
Public Sub New (
	outerLoopVertices As IList(Of XYZ),
	materialId As ElementId
)
```
```cpp
public:
TessellatedFace(
	IList<XYZ^>^ outerLoopVertices,
	ElementId^ materialId
)
```
```fsharp
new :
        outerLoopVertices : IList<XYZ> *
        materialId : ElementId -> TessellatedFace
```

#### Parameters

outerLoopVertices IListXYZ

materialId ElementId

#### Reference

TessellatedFace Class

TessellatedFace Overload

Autodesk.Revit.DB Namespace